package com.javarush.test.level05.lesson12.home04;

/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 12 2012".
*/

import java.text.SimpleDateFormat;
import java.util.Date;

public class Solution
{
    public static void main(String[] args)
    {
        //Напишите тут ваш код
        Date today = new Date();
        SimpleDateFormat ft = new SimpleDateFormat ("dd MM yyy");
        System.out.print(ft.format(today));
    }
}
