package com.javarush.test.level14.lesson08.home02;

/**
 * Created by Andrew on 29.03.2014.
 * 1. Создать абстрактный класс Drink с реализованным методом public void taste(), который выводит в консоль "Вкусно"
 */
public abstract class Drink
{
    public void taste()
    {
        System.out.println("Вкусно");
    }
}
